Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.72/PIC32CM-JH01/edc/PIC32CM5164JH01048.PIC
      <edc:AdjustPoint edc:_addr="0x41004022" edc:offset="0x6"/>
      <edc:SFRDef edc:_addr="0x41004028" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PBLDATA0" edc:mclr="11111111111111111111111111111111" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="PBLDATA" edc:desc="Page Buffer Load Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100402C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PBLDATA1" edc:mclr="11111111111111111111111111111111" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="PBLDATA" edc:desc="Page Buffer Load Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004030" edc:offset="0x50"/>
      <edc:SFRDef edc:_addr="0x41004080" edc:access="nnnnnnnn------nn" edc:cname="ECCCTRL" edc:impl="0xFF03" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="ECCDIS" edc:desc="FLASH ECC Disable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="En" edc:desc="Flash ECC is Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="Dis" edc:desc="Flash ECC is Not Enabled, once written to 1 by user ECC can only be re-enabled only by a reset" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ECCDFDIS" edc:desc="Data Flash ECC Disable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="En" edc:desc="Data Flash ECC is Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="Dis" edc:desc="Data Flash ECC is Not Enabled, once written to 1 by user ECC can only be re-enabled only by a reset" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SECCNT" edc:desc="Flash SEC Count" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004082" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x41004084" edc:access="-nnn----------nn" edc:cname="FLTCTRL" edc:impl="0x7003" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="FLTRST" edc:desc="Fault reset" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="Val_0" edc:desc="No Effect" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="Val_1" edc:desc="Resets all FLT SFR bits. {FLTCTRL, FFLTPTR, FFLTADR, FFLTCAP, FFLTPAR, FFLTSYN}" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FLTEN" edc:desc="Fault Injection Enabled" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="Dis" edc:desc="Disables the Write/Read fault injection" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="En" edc:desc="Enables the Write/Read fault injection to occur selected by FLTMD" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="FLTMD" edc:desc="Fault Mode Control" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="Val_0" edc:desc="Fault Injection Disabled" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="Val_2" edc:desc="Fault Capture Mode Enabled (Capture the address (in FFLTCAP) and Syndrome in (FFLTSYND))" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="Val_4" edc:desc="Single Fault Injection (at bit selected by FLT1PTR) for Reads" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="Val_5" edc:desc="Double Fault Injection (uses FLT1PTR and FLT2PTR) for Reads" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="Val_6" edc:desc="Single Fault Injection (at bit selected by FLT1PTR) for Writes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="Val_7" edc:desc="Double Fault Injection (uses FLT1PTR and FLT2PTR) for Writes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004086" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x41004088" edc:access="--------nnnnnnnn--------nnnnnnnn" edc:cname="FFLTPTR" edc:impl="0xFF00FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="FLT1PTR" edc:desc="Fault Injection Pointer 1" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="FLT2PTR" edc:desc="Fault Injection pointer 2" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100408C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="FFLTADR" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="FLTADR" edc:desc="Fault Injection Address" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
